# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [2]:
# import required libraries
import numpy as np
import pandas as pd

Next, extract and import `Orders` dataset into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [23]:
# your code here
orders=pd.read_csv('Orders.csv')
orders

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,541904,581587,22613,2011,12,5,12,pack of 20 spaceboy napkins,12,2011-12-09 12:50:00,0.85,12680,France,10.20
397920,541905,581587,22899,2011,12,5,12,children's apron dolly girl,6,2011-12-09 12:50:00,2.10,12680,France,12.60
397921,541906,581587,23254,2011,12,5,12,childrens cutlery dolly girl,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397922,541907,581587,23255,2011,12,5,12,childrens cutlery circus parade,4,2011-12-09 12:50:00,4.15,12680,France,16.60
397923,541908,581587,22138,2011,12,5,12,baking set 9 piece retrospot,3,2011-12-09 12:50:00,4.95,12680,France,14.85

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [4]:
# your code here
encoded_orders=pd.get_dummies(orders['CustomerID'])
encoded_orders.head()

,12346,12347,12348,12349,12350,12352,12353,12354,12355,12356,...,18273,18274,18276,18277,18278,18280,18281,18282,18283,18287
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [5]:
encoded_orders['amount_spent']=orders['amount_spent']
encoded_orders

,12346,12347,12348,12349,12350,12352,12353,12354,12355,12356,...,18274,18276,18277,18278,18280,18281,18282,18283,18287,amount_spent
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,15.30
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,20.34
2,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,22.00
3,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,20.34
4,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,20.34
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
397919,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,10.20
397920,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,12.60
397921,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,16.60
397922,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,16.60
397923,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,14.85

In [6]:
spent = orders.groupby('CustomerID')['amount_spent'].sum()
spent.sort_values()

CustomerID
13256         0.00
16738         3.75
14792         6.20
16454         6.90
17956        12.75
           ...
14911    143825.06
16446    168472.50
17450    194550.79
18102    259657.30
14646    280206.02
Name: amount_spent, Length: 4339, dtype: float64

In [7]:
total=orders['amount_spent'].sum()
print(total)

8911407.904

In [19]:
vip_percentile = spent.quantile(0.95)
vip_percentile

5840.181999999983

In [80]:
preferred_percentile = spent.quantile(0.75)
preferred_percentile

1661.6400000000003

In [83]:
hey = pd.DataFrame(spent)
hey = hey.reset_index()
hey

      CustomerID  amount_spent
0          12346      77183.60
1          12347       4310.00
2          12348       1797.24
3          12349       1757.55
4          12350        334.40
...          ...           ...
4334       18280        180.60
4335       18281         80.82
4336       18282        178.05
4337       18283       2094.88
4338       18287       1837.28

[4339 rows x 2 columns]

In [84]:
vip_customers = hey[hey['amount_spent'] >= vip_percentile]
vip_customers

      CustomerID  amount_spent
0          12346      77183.60
10         12357       6207.67
12         12359       6372.58
50         12409      11072.67
55         12415     124914.53
...          ...           ...
4207       18109       8052.97
4229       18139       8438.34
4253       18172       7561.68
4292       18223       6484.54
4298       18229       7276.90

[217 rows x 2 columns]

In [89]:
preferred_customers1 = hey[hey['amount_spent'] >= preferred_percentile]
preferred_customers = preferred_customers1[preferred_customers1['amount_spent'] < vip_percentile]
preferred_customers

      CustomerID  amount_spent
1          12347       4310.00
2          12348       1797.24
3          12349       1757.55
5          12352       2506.04
9          12356       2811.43
...          ...           ...
4319       18259       2338.60
4320       18260       2643.20
4328       18272       3078.58
4337       18283       2094.88
4338       18287       1837.28

[868 rows x 2 columns]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [91]:
# your code here
country_data = orders[['CustomerID', 'Country']]
country_data

        CustomerID         Country
0            17850  United Kingdom
1            17850  United Kingdom
2            17850  United Kingdom
3            17850  United Kingdom
4            17850  United Kingdom
...            ...             ...
397919       12680          France
397920       12680          France
397921       12680          France
397922       12680          France
397923       12680          France

[397924 rows x 2 columns]

In [92]:
country_data = country_data.drop_duplicates()
country_data

        CustomerID         Country
0            17850  United Kingdom
9            13047  United Kingdom
26           12583          France
46           13748  United Kingdom
65           15100  United Kingdom
...            ...             ...
394965       13436  United Kingdom
395041       15520  United Kingdom
395777       13298  United Kingdom
396506       14569  United Kingdom
397783       12713         Germany

[4347 rows x 2 columns]

In [93]:
country_data_vip = vip_customers.merge(country_data, how = 'inner', on = 'CustomerID')
country_data_vip

     CustomerID  amount_spent         Country
0         12346      77183.60  United Kingdom
1         12357       6207.67     Switzerland
2         12359       6372.58          Cyprus
3         12409      11072.67     Switzerland
4         12415     124914.53       Australia
..          ...           ...             ...
213       18109       8052.97  United Kingdom
214       18139       8438.34  United Kingdom
215       18172       7561.68  United Kingdom
216       18223       6484.54  United Kingdom
217       18229       7276.90  United Kingdom

[218 rows x 3 columns]

In [108]:
vip_country = country_data_vip['Country']
vip_country.groupby(vip_country.tolist()).size().sort_values(ascending = False)

United Kingdom     177
Germany             10
France               9
Switzerland          3
Spain                2
Portugal             2
Australia            2
EIRE                 2
Japan                2
Finland              1
Belgium              1
Netherlands          1
Norway               1
Denmark              1
Singapore            1
Cyprus               1
Sweden               1
Channel Islands      1
Name: Country, dtype: int64

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [96]:
# your code here
vip_and_preferred = hey[hey['amount_spent'] >= preferred_percentile]
vip_and_preferred

      CustomerID  amount_spent
0          12346      77183.60
1          12347       4310.00
2          12348       1797.24
3          12349       1757.55
5          12352       2506.04
...          ...           ...
4319       18259       2338.60
4320       18260       2643.20
4328       18272       3078.58
4337       18283       2094.88
4338       18287       1837.28

[1085 rows x 2 columns]

In [110]:
vip_preferred_country = vip_and_preferred.merge(country_data, how = 'inner', on = 'CustomerID')
vip_preferred_country

      CustomerID  amount_spent         Country
0          12346      77183.60  United Kingdom
1          12347       4310.00         Iceland
2          12348       1797.24         Finland
3          12349       1757.55           Italy
4          12352       2506.04          Norway
...          ...           ...             ...
1086       18259       2338.60  United Kingdom
1087       18260       2643.20  United Kingdom
1088       18272       3078.58  United Kingdom
1089       18283       2094.88  United Kingdom
1090       18287       1837.28  United Kingdom

[1091 rows x 3 columns]

In [111]:
vip_preferred_country = vip_preferred_country['Country']
vip_preferred_country.groupby(vip_preferred_country.tolist()).size().sort_values(ascending = False)

United Kingdom     932
Germany             39
France              29
Belgium             12
Switzerland          9
Spain                9
Portugal             7
Norway               7
Italy                5
Finland              5
Japan                4
Australia            4
Cyprus               4
Channel Islands      4
Austria              3
EIRE                 3
Denmark              3
Sweden               2
Israel               2
Iceland              1
Greece               1
Lebanon              1
Malta                1
Netherlands          1
Poland               1
Singapore            1
Canada               1
Name: Country, dtype: int64